Repository: manuelvalinogonzalez/Last-Projects
Catalog: Shared Expenses Demo Application/desktop/locales/*/LC_MESSAGES/messages.po
Languages: pt

source: Shared Expenses
pt: Despesas Partilhadas

source: Friends
pt: Amigos

source: Expenses
pt: Despesas

source: Add friend
pt: Adicionar amigo

source: Delete friend
pt: Eliminar amigo

source: Pay balance
pt: Pagar saldo

source: Delete all
pt: Eliminar tudo

source: Add expense
pt: Adicionar despesa

source: Edit expense
pt: Editar despesa

source: Delete expense
pt: Eliminar despesa

source: Refresh data
pt: Atualizar dados

source: Maximize
pt: Maximizar

source: Restore
pt: Restaurar

source: Friend name:
pt: Nome do amigo:

source: Enter name
pt: Introduza o nome

source: Description:
pt: Descrição:

source: Amount:
pt: Montante:

source: Date (YYYY-MM-DD):
pt: Data (AAAA-MM-DD):

source: Participants:
pt: Participantes:

source: Who paid?
pt: Quem pagou?

source: Who participated?
pt: Quem participou?

source: Amount to pay:
pt: Quantia a pagar:

source: Cancel
pt: Cancelar

source: Add
pt: Adicionar

source: Save
pt: Guardar

source: Pay
pt: Pagar

source: Loading...
pt: A carregar...

source: Loading data...
pt: A carregar dados...

source: Adding friend '{name}'...
pt: A adicionar amigo '{name}'...

source: Deleting friend '{name}'...
pt: A eliminar amigo '{name}'...

source: Adding expense '{description}'...
pt: A adicionar despesa '{description}'...

source: Deleting expense...
pt: A eliminar despesa...

source: Updating expense...
pt: A atualizar despesa...

source: Getting participants...
pt: A obter participantes...

source: Registering payment of {amount}...
pt: A registar pagamento de {amount}...

source: Deleting {count} expenses...
pt: A eliminar {count} despesas...

source: Deleting {count} friends...
pt: A eliminar {count} amigos...

source: Friend '{name}' added successfully
pt: Amigo '{name}' adicionado com sucesso

source: Friend {name} deleted successfully
pt: Amigo {name} eliminado com sucesso

source: Expense '{description}' added successfully
pt: Despesa '{description}' adicionada com sucesso

source: Expense deleted successfully
pt: Despesa eliminada com sucesso

source: Expense updated successfully
pt: Despesa atualizada com sucesso

source: Payment of {amount} registered successfully
pt: Pagamento de {amount} registado com sucesso

source: {count} expenses deleted successfully
pt: {count} despesas eliminadas com sucesso

source: {count} friends deleted successfully
pt: {count} amigos eliminados com sucesso

source: An error occurred
pt: Ocorreu um erro

source: Information
pt: Informação

source: Cannot connect to server. Verify that the server is running.
pt: Não é possível ligar ao servidor. Verifique se o servidor está em execução.

source: Server took too long to respond. Try again.
pt: O servidor demorou muito a responder. Tente novamente.

source: Error loading data: {error}
pt: Erro ao carregar dados: {error}

source: Error adding friend: {error}
pt: Erro ao adicionar amigo: {error}

source: Error deleting friend: {error}
pt: Erro ao eliminar amigo: {error}

source: Error adding expense: {error}
pt: Erro ao adicionar despesa: {error}

source: Error deleting expense: {error}
pt: Erro ao eliminar despesa: {error}

source: Error updating expense: {error}
pt: Erro ao atualizar despesa: {error}

source: Error getting participants: {error}
pt: Erro ao obter participantes: {error}

source: You must add friends first
pt: Tem de adicionar amigos primeiro

source: Amount must be greater than 0
pt: O montante tem de ser superior a 0

source: You must select at least one participant
pt: Deve seleccionar pelo menos um participante

source: Amount must be a valid number
pt: O montante deve ser um número válido

source: You must enter an amount
pt: Tem de introduzir um montante

source: Expense not found
pt: Despesa não encontrada

source: Cannot delete {name} because they have a pending balance of {amount}
pt: Não é possível eliminar {name} porque tem um saldo pendente de {amount}

source: No expenses to delete
pt: Não há despesas para eliminar

source: No friends to delete
pt: Não há amigos para eliminar

source: Balance: {amount}
pt: Saldo: {amount}

source: Per person: {amount} ({count} people)
pt: Por pessoa: {amount} ({count} pessoas)

source: Paid by: {name}
pt: Pago por: {name}

source: Pay balance of {name}
pt: Pagar saldo de {name}

source: Unknown
pt: Desconhecido

source: Some friends could not be deleted
pt: Alguns amigos não puderam ser eliminados

source: Deleted {deleted} of {total} friends. Friends not deleted: {errors}
pt: Foram eliminados {deleted} de {total} amigos. Amigos não eliminados: {errors}
