Repository: manuelvalinogonzalez/Last-Projects
Catalog: SplitWithMe/desktop/locales/*/LC_MESSAGES/messages.po
Languages: es

source: Shared Expenses
es: Gastos Compartidos

source: Friends
es: Amigos

source: Expenses
es: Gastos

source: Add friend
es: Añadir amigo

source: Delete friend
es: Eliminar amigo

source: Pay balance
es: Pagar saldo

source: Delete all
es: Borrar todos

source: Add expense
es: Añadir gasto

source: Edit expense
es: Editar gasto

source: Delete expense
es: Eliminar gasto

source: Refresh data
es: Actualizar datos

source: Maximize
es: Maximizar

source: Restore
es: Restaurar

source: Friend name:
es: Nombre del amigo:

source: Enter name
es: Introduce el nombre

source: Description:
es: Descripción:

source: Amount:
es: Monto:

source: Date (YYYY-MM-DD):
es: Fecha (YYYY-MM-DD):

source: Participants:
es: Participantes:

source: Who paid?
es: ¿Quién pagó?

source: Who participated?
es: ¿Quiénes participaron?

source: Amount to pay:
es: Importe a pagar:

source: Cancel
es: Cancelar

source: Add
es: Añadir

source: Save
es: Guardar

source: Pay
es: Pagar

source: Loading...
es: Cargando...

source: Loading data...
es: Cargando datos...

source: Adding friend '{name}'...
es: Añadiendo amigo '{name}'...

source: Deleting friend '{name}'...
es: Eliminando amigo '{name}'...

source: Adding expense '{description}'...
es: Añadiendo gasto '{description}'...

source: Deleting expense...
es: Eliminando gasto...

source: Updating expense...
es: Actualizando gasto...

source: Getting participants...
es: Obteniendo participantes...

source: Registering payment of {amount}...
es: Registrando pago de {amount}...

source: Deleting {count} expenses...
es: Eliminando {count} gastos...

source: Deleting {count} friends...
es: Eliminando {count} amigos...

source: Friend '{name}' added successfully
es: Amigo '{name}' añadido correctamente

source: Friend {name} deleted successfully
es: Amigo {name} eliminado exitosamente

source: Expense '{description}' added successfully
es: Gasto '{description}' añadido correctamente

source: Expense deleted successfully
es: Gasto eliminado correctamente

source: Expense updated successfully
es: Gasto actualizado correctamente

source: Payment of {amount} registered successfully
es: Pago de {amount} registrado correctamente

source: {count} expenses deleted successfully
es: Se eliminaron {count} gastos correctamente

source: {count} friends deleted successfully
es: Se eliminaron {count} amigos correctamente

source: An error occurred
es: Ha ocurrido un error

source: Information
es: Información

source: Cannot connect to server. Verify that the server is running.
es: No se puede conectar al servidor. Verifica que el servidor esté ejecutándose.

source: Server took too long to respond. Try again.
es: El servidor tardó demasiado en responder. Inténtalo de nuevo.

source: Error loading data: {error}
es: Error al cargar datos: {error}

source: Error adding friend: {error}
es: Error al añadir amigo: {error}

source: Error deleting friend: {error}
es: Error al eliminar amigo: {error}

source: Error adding expense: {error}
es: Error al añadir gasto: {error}

source: Error deleting expense: {error}
es: Error al eliminar gasto: {error}

source: Error updating expense: {error}
es: Error al actualizar gasto: {error}

source: Error registering payment: {error}
es: Error al registrar pago: {error}

source: Error deleting expenses: {error}
es: Error al eliminar gastos: {error}

source: Error deleting friends: {error}
es: Error al eliminar amigos: {error}

source: Error getting participants: {error}
es: Error al obtener participantes: {error}

source: You must add friends first
es: Primero debes añadir amigos

source: Amount must be greater than 0
es: El monto debe ser mayor que 0

source: You must select at least one participant
es: Debe seleccionar al menos un participante

source: Amount must be a valid number
es: El monto debe ser un número válido

source: You must enter an amount
es: Debe introducir un importe

source: Expense not found
es: Gasto no encontrado

source: Cannot delete {name} because they have a pending balance of {amount}
es: No se puede eliminar {name} porque tiene un saldo pendiente de {amount}

source: No expenses to delete
es: No hay gastos para eliminar

source: No friends to delete
es: No hay amigos para eliminar

source: Balance: {amount}
es: Saldo: {amount}

source: Per person: {amount} ({count} people)
es: Por persona: {amount} ({count} personas)

source: Paid by: {name}
es: Pagador: {name}

source: Pay balance of {name}
es: Pagar saldo de {name}

source: Unknown
es: Desconocido

source: Some friends could not be deleted
es: Algunos amigos no se pudieron eliminar

source: Deleted {deleted} of {total} friends. Friends not deleted: {errors}
es: Se eliminaron {deleted} de {total} amigos. Amigos no eliminados: {errors}
